# MIT 6.824

## Lecture 01 - Introduction

### Drivens and Challenges

>分布式系统：核心是通过网络来协调，共同完成一致任务的一些计算机。
>
>案例：大型网站的储存系统、大数据运算。

使用大量的相互协作的计算机驱动力是：

+ **高性能**
+ **容错**
+ 物理分布式系统
+ 安全性 

分布式的挑战：

+ 并发带来的时间依赖问题（**同步和异步**）
+ 分布式的众多组成部分的**局部错误**
+ 分布式系统**性能**的难以估量性

### Course Structure

> 课程的结构主要是：papers and **labs**
>
> labs:
>
> + MapReduce
> + Raft for fault tolerate: 复制和故障时自动切换实现
> + kv  server of raft：建立在2上的kv存储服务
> + Sharded kv service：建立在3上的分片kv存储系统

### Abstraction and Implementation

> 课程主要内容：第三方应用程序及其的所基于的基础架构（主要是存储、通信和计算），其中最主要的基础架构是存储。
>
> 目标：设计一些简单接口（抽象于基础架构的），让第三方应用能够使用这些分布式的存储和计算，建立一个极高性能和容错性的分布式系统，提供简单的对外接口，对外隐藏其分布式特性。
>
> 实现的基础：
>
> + RPC
> + 线程
> + 并发控制

### Scalability

>通过多台计算机构成的系统实现多倍的性能或吞吐量
>
>特点：只需要简单地扩展机器数量就可以实现性能提升，无需代价高昂的重构或算法优化

### Availability

> 错误终将发生，我们所能做的就是在设计时就考虑到这些可能 发生的错误，并屏蔽它们。这需要构建一种基础架构，能够尽可能多的应对开发人员屏蔽和掩盖错误。
>
> 容错的核心思想即为可用性。可用性即系统在发生特定错误类型时继续正常运行，提供完整服务。副本copy是可用性的一种实现方式。可用系统通常是指，在特定的故障范围内，系统仍然能够提供服务，系统仍然是可用的。如果出现了更多的故障，系统将不再可用。
>
> 容错的另一特性是可恢复性（recoverability），即系统出错停止工作后通过修复可以继续正常运行。

可用性和可恢复性的实现工具有：

+ 非易失存储 问题是性能差
+ 复制（replication）问题是多副本的管理问题，副本之间偏离同步状态

### Consistency

>所有副本每次读取的值是最新值（强一致性）：昂贵的通信问题
>
>部分副本每次读取的值可以不是最新值（弱一致性）：易于实现的，只需要更新/读取最近的数据副本

